import pytest

from chinese import cn2int


@pytest.mark.parametrize('input,output', [
    ('〇', 0),
    ('一', 1),
    ('十', 10),
    ('十一', 11),
    ('三十', 30),
    ('三十一', 31),
    ('九十九', 99),
    ('百', 100),
    ('一百', 100),
    ('一千一百八十', 1180),
    ('十万', 100000),
    ('十一万', 110000),
    ('一百万', 1000000),
    ('一千一十一万', 10110000),
    ('一千零一十一万', 10110000),
    ('一千八百万五千零六十', 18005060),
    ('两亿一千八百万五千零六十', 218005060),
    ('四百亿一千八百万五千零六十', 40018005060),
    # ('四万亿一千八百万五千零六十', 4000018005060),
])
def test_cn2int(input, output):
    assert cn2int(input) == output
